
## Plan Result (terraform/cloudflare/b0xp.io/hitohub/prod)

[CI link](https://github.com/boxp/arch/actions/runs/8927537805)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.hitohub_prod_tunnel_token
  * cloudflare_record.api_hitohub_prod
  * cloudflare_record.hitohub_prod
  * cloudflare_tunnel.hitohub_prod_tunnel
  * cloudflare_tunnel_config.hitohub_prod_tunnel
  * random_password.tunnel_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.hitohub_prod_tunnel_token will be created
  + resource "aws_ssm_parameter" "hitohub_prod_tunnel_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "for hitohub prod tunnel token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "hitohub-prod-tunnel-token"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # cloudflare_record.api_hitohub_prod will be created
  + resource "cloudflare_record" "api_hitohub_prod" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api-hitohub"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_record.hitohub_prod will be created
  + resource "cloudflare_record" "hitohub_prod" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "hitohub"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel.hitohub_prod_tunnel will be created
  + resource "cloudflare_tunnel" "hitohub_prod_tunnel" {
      + account_id   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "cloudflare hitohub-prod tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # cloudflare_tunnel_config.hitohub_prod_tunnel will be created
  + resource "cloudflare_tunnel_config" "hitohub_prod_tunnel" {
      + account_id = "1984a4314b3e75f3bedce97c7a8e0c81"
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = (known after apply)
              + service  = "http://hitohub-frontend:3000"
            }
          + ingress_rule {
              + hostname = (known after apply)
              + service  = "http://hitohub-back-end:8080"
            }
          + ingress_rule {
              + service = "http_status:404"
            }
        }
    }

  # random_password.tunnel_secret will be created
  + resource "random_password" "tunnel_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/cloudflare/b0xp.io/hitohub/prod/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/351/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":351,"Program":"tfcmt","SHA1":"682247929083c30336f26e5825ac42a2161f6884","Target":"terraform/cloudflare/b0xp.io/hitohub/prod","Vars":{},"WorkflowName":"pull_request_target"} -->